EDT/ZUP/zup_edt/src/Catalogs/кдНастройкиИнтеграции/кдНастройкиИнтеграции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>кдНастройкиИнтеграции</name>
  <attributes>
    <name>ПутьОпределенияВебСервиса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>URIПространстваИменСервиса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСервиса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяТочкиПодключения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Сервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДопПараметры</name>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDT/ZUP/zup_edt/src/Catalogs/кдНастройкиИнтеграции/ObjectModule.bsl
Функция ПолучитьПароль() экспорт
	
	ТекПароль = Пароль.Получить();
	Возврат ?(НЕ ЗначениеЗаполнено(ТекПароль),"",ТекПароль);

КонецФункции // ()

Функция Параметр(ИмяПараметра, значениеПоУмолчанию = Неопределено) экспорт
	НайдСтрока = ДопПараметры.Найти(ИмяПараметра,"Параметр");
	Если НайдСтрока=Неопределено Тогда
		Возврат значениеПоУмолчанию;
	Иначе	
		Возврат НайдСтрока.Значение;
	КонецЕсли;
КонецФункции // ()

Функция СтрПараметры() Экспорт
	стрПарам = новый Структура;
	Для каждого ТекСтрока Из ДопПараметры Цикл
		стрПарам.Вставить(ТекСтрока.Параметр, ТекСтрока.Значение);
	КонецЦикла;
	
	//Начало: Хафизов Ф.Ф., Настройки интеграции 20.02.2019
	Возврат стрПарам;
	//Конец:  Хафизов Ф.Ф., Настройки интеграции 20.02.2019
КонецФункции // ()
